* Initial review of data
:PROPERTIES:
:dir: ../data
:END:

** Convert to CSV

So far we have three files with header data, and need want to convert them to CSV. Let's see what Pandoc can do!

#+begin_src sh
pandoc -h | grep xls
#+end_src 

Apparently nothing. OK, let's convert via LibreOffice.

#+begin_src sh
ls csv
#+end_src

#+RESULTS:
| august-december-2013.csv                                     |
| info-request-indy-2014-PRIP-data.csv                         |
| PRIP-inspections-jan-2013-aug-2013-cases-with-violations.csv |
| PRIP-inspections-jan-2013-aug-2013-insp-with-owner.csv       |

We've got four files now, because PRIP inspections Jan 2013 - August 2013 had two sheets.

** First look
:PROPERTIES:
:dir: ../data/csv
:END:

Let's see what =csvkit= can tell us about this data.

#+begin_src sh :results pp
csvstat info-request-indy-2014-PRIP-data.csv
#+end_src

#+RESULTS:
#+begin_example
  1. Case
	<type 'unicode'>
	Nulls: False
	Unique values: 575
	5 most frequent values:
		13-5072:	23
		14-1335:	21
		14-3805:	20
		13-6951:	20
		14-1463:	19
	Max length: 7
  2. Address Num
	<type 'unicode'>
	Nulls: True
	Unique values: 242
	5 most frequent values:
		415:	78
		414:	66
		301:	48
		801:	47
		800:	45
	Max length: 7
  3. Apt
	<type 'unicode'>
	Nulls: True
	Unique values: 160
	5 most frequent values:
		B:	238
		A:	189
		EXT:	117
		Ext:	95
		C:	65
	Max length: 10
  4. Street
	<type 'unicode'>
	Nulls: True
	Unique values: 155
	5 most frequent values:
		E PILOT ST:	145
		S ROXBORO ST:	145
		FAYETTEVILLE ST:	89
		HOLLOWAY ST:	84
		FARGO ST:	67
	Max length: 20
  5. Topic
	<type 'unicode'>
	Nulls: True
	Values: PRIP
  6. Status
	<type 'unicode'>
	Nulls: True
	Unique values: 10
	5 most frequent values:
		Closed - Non Voluntary Owner:	918
		Closed - Voluntary:	445
		Open:	231
		Open - Judicial:	227
		Closed - Not in Violation:	148
	Max length: 28
  7. Owner Name
	<type 'unicode'>
	Nulls: True
	Unique values: 280
	5 most frequent values:
		EAGLE POINT 2014 LLC:	144
		LEE RAY BERGMAN LLC:	120
		SOUTHERN REPAIR SERVICE INCORP:	51
		EDGEMONT ELMS LTD PARTNERSHIP:	41
		MYLES SASHA:	40
	Max length: 76
  8. First Inspection Date
	<type 'datetime.date'>
	Nulls: True
	Min: 2014-01-03
	Max: 2014-12-18
	Unique values: 170
	5 most frequent values:
		2014-06-11:	74
		2014-03-24:	65
		2014-08-08:	48
		2014-01-21:	43
		2014-03-20:	40
  9. Violation
	<type 'unicode'>
	Nulls: True
	Unique values: 128
	5 most frequent values:
		Good repair and safe condition:	202
		Walls, exterior not sound, weatherproof or vermin proof:	124
		Smoke detectors missing or not working:	124
		Switches, fixtures, and devices not operable or safe:	98
		Plumbing or plumbing fixtures needs repair:	84
	Max length: 74
 10. Violation Corrections
	<type 'unicode'>
	Nulls: True
	Unique values: 1480
	5 most frequent values:
		bathroom:	17
		exterior:	16
		rear porch:	9
		Repair as needed.:	6
		Kitchen:	6
	Max length: 331

Row count: 2184
#+end_example

OK! Some interesting data here, without even really scratching the surface. And it looks like the answer to this week's question, "Who is the biggest offender", is Eagle Point 2014 LLC (144), with Lee Ray Bergman LLC (120) a close second, for this period (2014) in any case.

This brings up a good point: I should generate a CSV export combining the Jan - August 2013, August - December 2013, and 2014 records together. Need to figure out which of the Jan - August 2013 files to use though.

Even more useful may be to put this all into a SQLite database so we can run queries against it.
